## Plan for terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                              |
|----------|---------------------------------------------------------------|
| add      | `aws_iam_policy.lambda_list_layers`                           |
|          | `aws_iam_role.lambda_list_layers`                             |
|          | `aws_iam_role_policy_attachment.lambda_list_layers`           |
| recreate | `aws_lambda_layer_version.lambda_layer`                       |
|          | `aws_lambda_layer_version_permission.lambda_layer_permission` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.lambda_list_layers will be created
  + resource "aws_iam_policy" "lambda_list_layers" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow listing Lambda layers and versions"
      + id               = (known after apply)
      + name             = "lambda-list-layers"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:ListLayers",
                          + "lambda:ListLayerVersions",
                          + "lambda:GetFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListLayers"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.lambda_list_layers will be created
  + resource "aws_iam_role" "lambda_list_layers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::891376947407:role/aws-reserved/sso.amazonaws.com/ca-central-1/AWSReservedSSO_AWSAdministratorAccess_0d3ceb64314771e4",
                              + "arn:aws:iam::800095993820:role/notification-terraform-plan",
                              + "arn:aws:iam::800095993820:role/notification-terraform-apply",
                              + "arn:aws:iam::800095993820:role/aws-reserved/sso.amazonaws.com/ca-central-1/AWSReservedSSO_AWSAdministratorAccess_e6e62a284c3c35fc",
                              + "arn:aws:iam::296255494825:role/notification-terraform-plan",
                              + "arn:aws:iam::296255494825:role/notification-terraform-apply",
                              + "arn:aws:iam::296255494825:role/aws-reserved/sso.amazonaws.com/ca-central-1/AWSReservedSSO_AWSAdministratorAccess_dcf2167fdeb47617",
                              + "arn:aws:iam::239043911459:role/notification-terraform-plan",
                              + "arn:aws:iam::239043911459:role/notification-terraform-apply",
                              + "arn:aws:iam::239043911459:role/aws-reserved/sso.amazonaws.com/ca-central-1/AWSReservedSSO_AWSAdministratorAccess_4085b2fdb6f29f43",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-list-layers"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda_list_layers will be created
  + resource "aws_iam_role_policy_attachment" "lambda_list_layers" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-list-layers"
    }

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:170" -> (known after apply)
      ~ code_sha256                 = "kTWyQTKMoV1L8jzX2I//cJfjGGN7Y9fdO0cDlhmajAM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-11-04T13:30:11.344+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:170" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "kTWyQTKMoV1L8jzX2I//cJfjGGN7Y9fdO0cDlhmajAM=" -> "+ZM/8c/KmZOg8S0cAZjbxl2aLj7Wk9szH7SXhovF0R0=" # forces replacement
      ~ source_code_size            = 15412425 -> (known after apply)
      ~ version                     = "170" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version_permission.lambda_layer_permission must be replaced
-/+ resource "aws_lambda_layer_version_permission" "lambda_layer_permission" {
      ~ id             = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer,170" -> (known after apply)
      ~ layer_name     = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply) # forces replacement
      ~ policy         = jsonencode(
            {
              - Id        = "default"
              - Statement = [
                  - {
                      - Action    = "lambda:GetLayerVersion"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:170"
                      - Sid       = "shared-layer-permission"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ revision_id    = "43a6b2be-571e-4128-9794-d2a995f52531" -> (known after apply)
      ~ version_number = 170 -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_list_layers"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda_list_layers"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
